# Напишите процедуру, которая выводит на экран
# запись переданного ей числа в римской системе счисления.
# Числа находятся в диапазоне [1, 3999]
# I - 1, V - 5, X - 10, L - 50, C  - 100, D - 500, M - 1000
# Пример:
# 2013
# MMXIII
def f(N):
    a=''
    a+='M'*(N//1000)
    N=N-(N//1000)*1000
    if N//100>=5:
        a+="D"
        N-=500
    a+="C"*(N//100)
    N=N-(N//100)*100
    if N//10>=5:
        a+="L"
        N-=50
    a+="X"*(N//10)
    N=N-(N//10)*10
    if N>=5:
        a+="V"
        N-=5
    a+="I"*(N)
    print(a)
print(f(int(input())))
