# Напишите функцию, которая «переворачивает» число,
# то есть возвращает число, в котором цифры стоят в обратном порядке.
# Вводится натуральное число
# Пользоваться input()[::-1] запрещено!
# Идея задачи реализовать алгоритм,
# который будет работать для любого введенного натурального числа.

def f(n):
    if len(n)==1:
        return n
    else:
        return n[-1]+f(n[0:len(n)-1])
print(f(input()))
