# Напишите функцию number_to_words(num), которая принимает
# в качестве аргумента натуральное число num и возвращает
# его словесное описание на русском языке.
#
# Примечание 1.
# Считайте, что число 1 ≤ num ≤ 99.
#
# Примечание 2.
# Следующий программный код:
#
# print(number_to_words(7))
# print(number_to_words(85))
# должен выводить:
#
# семь
# восемьдесят пять

ed=["","один","два","три","четыре","пять","шесть","семь", "восемь","девять"]
di=["двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"]
osob=["десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать",'девятнадцать']
def number_to_words(num):
    if len(str(num))==1:
        return ed[num]
    else:
        if num>9 and num<20:
            return osob[num-10]
        else:
            return di[num//10-2]+" "+ed[num%10]
print(number_to_words(7))